# RebarContainerOutSideOfHostWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarContainerOutSideOfHostWarning Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Container is placed completely outside of its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarContainerOutSideOfHostWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarContainerOutSideOfHostWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarContainerOutSideOfHostWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace